#  Завдання 1
# Напишіть чат бота, який імітує замовлення піци. Чат бот
# має бути ввічливим. Реалізуйте функціонал:
# 1. Показати меню
# 2. Задати питання
# 3. Зробити замовлення
# 4. Змінити замовлення
# 5. Підтвердити замовлення(бот має показати суму
# замовлення)

from langchain_google_genai import ChatGoogleGenerativeAI
from langchain.prompts import PromptTemplate
from langchain_core.messages import (
    HumanMessage,
    AIMessage,
    SystemMessage,
    trim_messages
)


import json
import dotenv
import os

# завантажити api ключі з папки .env
dotenv.load_dotenv()

# отримати сам ключ
api_key = os.getenv('GEMINI_API_KEY')

# створення чат моделі
# Велика мовна модель(llm)

llm = ChatGoogleGenerativeAI(
    model='gemini-2.0-flash',  # назва моделі
    google_api_key=api_key,    # ваша API
)

messages = [
    SystemMessage("""
    Ти ввічливий чат бот . Твоя заача давати приймати замовлення в піцерії "Смак"
В тебе є меню піцерії. 
Спочатку за

    Меню: 
1. Маргарита (Томатний соус, моцарела, базилік)   Мала (25 см) 120грн   Велика (35 см) 140грн
2. Пепероні  (Томатний соус, моцарела, пепероні)  Мала (25 см) 160грн   Велика (35 см) 180грн
3. 4 сири   (Моцарела, дорблю, пармезан, чеддер)  Мала (25 см) 150грн   Велика (35 см) 170грн
4. Гавайська  (Томатний соус, моцарела, шинка, ананас ) Мала (25 см) 140грн   Велика (35 см) 160грн
5. Вегетаріанська  (Томатний соус, моцарела, болгарський перець, гриби, оливки, кукурудза ) Мала (25 см) 1300грн   Велика (35 см) 150грн

Крок 1: Запропонуй меню. Запитай користувача вибрати піцу, написавши її назву. Наприклад: "Маргарита", "Пепероні" і т.д. 

Крок 2: Вибери розмір: "Мала (25 см)" з ціною або "Велика (35 см) з ціною". 
        якщо користувач вибрав розмір то додати назву піци розмір і ціну до кошика та показати суму заказу
Крок 3: Запитай чи користувач хоче 1. Підтвердити, 2. Змінити чи 3. Додати ще.
        Якщо користувач хоче продовжити то покажи меню та запитай яку піцу він хоче добавити.
        Якщо користувач закінчив замовлення показати йому кошик з сумою по заказу
        та подякувати що відвідали нашу піцерію. Добавити що після оплати заказ буде
         готовий через 15 хвилин
    """)
]

# основний цикл
while True:
    # отримати повідомлення від користувача
    user_text = input('Ви: ')

    # умова зупинки
    if user_text == '':
        break

    # змінити тип даних на HumanMessage
    human_message = HumanMessage(user_text)

    # змінити історію
    messages.append(human_message)

    # застосувати модель
    response = llm.invoke(messages)
    # response -- AIMessage

    # змінити історію
    messages.append(response)

    # вивід результату
    print(f'AI: {response.content}')